<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<%= "1758071224 + 389412423" + "　の計算結果は　" + (1758071224 + 389412423) + "　です。" %>
	<br>
	<%="1625529294 - 521954353" + "　の計算結果は　" + (1625529294 - 521954353) +"　です。"%>
	<br>
	<%="8455 × 39412" + "　の計算結果は　"+ (8455L * 394123) +"　です。"%>
	<br>
	<%="64514887 ÷ 9181" + "　の計算結果は　"+(64514887 / 9181)+"　です。"%>
	<br>
	<%="1226995849" + "　を　" + "16807" + "　で割ったあまりは　" + (1226995849 % 16807) +"　です。"%>
</body>
</html>